In [1]:
import pandas as pd 
import numpy as np

In [2]:
path = "../Datasets/RAW/DxA23' Veri Seti.xlsx"

maaliyetler = pd.read_excel(path, sheet_name="İlçe Bazlı Maliyetler", skipfooter=0)
nufus = pd.read_excel(path, sheet_name="Mahalle Bazlı Nüfus Bilgisi", skipfooter=0)
brewstation = pd.read_excel(path, sheet_name="BrewStation Lokasyonları", skipfooter=0)

maaliyetler.head()

   #        İLÇE  KAHVE DÜKKANI AÇMA MALİYETİ
0  1      ADALAR                       429000
1  2  ARNAVUTKÖY                       201000
2  3    ATAŞEHİR                       486000
3  4     AVCILAR                       252000
4  5    BAĞCILAR                       315000

In [3]:
nufus.head()

,#,İLÇE,MAHALLE,NÜFUS YOĞUNLUĞU (KİŞİ/KM2),NÜFUS,YÜZÖLÇÜMÜ(KM2)
0,1,Arnavutköy,Anadolu,21607.0,33177,1.50
1,2,Arnavutköy,Yunus Emre,14919.0,16085,1.10
2,3,Arnavutköy,Boğazköy Atatürk,11965.0,7726,0.65
3,4,Arnavutköy,Arnavutköy İslambey,11923.0,18832,1.60
4,5,Arnavutköy,Mustafa Kemal Paşa,9630.0,12585,1.30

In [4]:
#set upper case
maaliyetler = maaliyetler.apply(lambda x: x.astype(str).str.upper())
nufus = nufus.apply(lambda x: x.astype(str).str.upper())
brewstation = brewstation.apply(lambda x: x.astype(str).str.upper())

In [5]:
maaliyetler = maaliyetler[['İLÇE', 'KAHVE DÜKKANI AÇMA MALİYETİ']]
maaliyetler.columns = ['ilce', 'maliyet']

nufus = nufus[['İLÇE', 'MAHALLE', 'NÜFUS YOĞUNLUĞU (KİŞİ/KM2)', 'NÜFUS', 'YÜZÖLÇÜMÜ(KM2)']]
nufus.columns = ['ilce', 'mahalle', 'nufus_yogunlugu', 'nufus', 'yuzolcumu']

brewstation = brewstation[['ŞEHİR', 'AÇIK ADRES', 'İLÇE', 'MAHALLE']]
brewstation.columns = ['sehir', 'acik_adres', 'ilce', 'mahalle']

<hr>

In [6]:
turkish_chars = {
    'ü': 'u',
    'Ü': 'U',
    'ğ': 'g',
    'Ğ': 'G',
    'ş': 's',
    'Ş': 'S',
    'ı': 'i',
    'İ': 'I',
    'ö': 'o',
    'Ö': 'O',
    'ç': 'c',
    'Ç': 'C'
}

In [7]:
nufus['ilce'] = nufus['ilce'].replace(turkish_chars, regex=True)
nufus['mahalle'] = nufus['mahalle'].replace(turkish_chars, regex=True)

nufus.head()

         ilce              mahalle nufus_yogunlugu  nufus yuzolcumu
0  ARNAVUTKOY              ANADOLU         21607.0  33177       1.5
1  ARNAVUTKOY           YUNUS EMRE         14919.0  16085       1.1
2  ARNAVUTKOY     BOGAZKOY ATATURK         11965.0   7726      0.65
3  ARNAVUTKOY  ARNAVUTKOY ISLAMBEY         11923.0  18832       1.6
4  ARNAVUTKOY   MUSTAFA KEMAL PASA          9630.0  12585       1.3

In [8]:
maaliyetler['ilce'] = maaliyetler['ilce'].replace(turkish_chars, regex=True)
maaliyetler.head()

         ilce maliyet
0      ADALAR  429000
1  ARNAVUTKOY  201000
2    ATASEHIR  486000
3     AVCILAR  252000
4    BAGCILAR  315000

In [9]:
brewstation['ilce'] = brewstation['ilce'].replace(turkish_chars, regex=True)
brewstation['mahalle'] = brewstation['mahalle'].replace(turkish_chars, regex=True)
brewstation.head()

,sehir,acik_adres,ilce,mahalle
0,İSTANBUL,"KOCATEPE MAH PAŞA CAD NO:3, FORUM ISTANBUL AVM...",BAYRAMPASA,KOCATEPE
1,İSTANBUL,MAHMUTBEY MAHALLESİ TAŞOCAĞI YOLU CAD. A BLOK ...,BAGCILAR,MAHMUTBEY
2,İSTANBUL,"MASLAK MAHALLESI, AHİ EVRAN CAD NO:6/A 42 SHOP...",SARIYER,MASLAK
3,İSTANBUL,"MALTEPE MAHALLESI, YEDIKULE ÇIRPICI YOLU NO:82...",ZEYTINBURNU,MALTEPE
4,İSTANBUL,ACARLAR MAH. ACARKENT 3.KISIM 9.CAD.DE ACARKEN...,BEYKOZ,ACARLAR

In [10]:
df = pd.merge(nufus, maaliyetler, on='ilce', how='left')
df.head()

         ilce              mahalle nufus_yogunlugu  nufus yuzolcumu maliyet
0  ARNAVUTKOY              ANADOLU         21607.0  33177       1.5  201000
1  ARNAVUTKOY           YUNUS EMRE         14919.0  16085       1.1  201000
2  ARNAVUTKOY     BOGAZKOY ATATURK         11965.0   7726      0.65  201000
3  ARNAVUTKOY  ARNAVUTKOY ISLAMBEY         11923.0  18832       1.6  201000
4  ARNAVUTKOY   MUSTAFA KEMAL PASA          9630.0  12585       1.3  201000

In [11]:
df.isnull().sum()

ilce                0
mahalle             0
nufus_yogunlugu     0
nufus               0
yuzolcumu           0
maliyet            28
dtype: int64

In [12]:
df[df['maliyet'].isnull()]['ilce'].unique()

array(['EYUP'], dtype=object)

In [13]:
nufus['ilce'] = nufus['ilce'].replace('EYUP', 'EYUPSULTAN')

In [14]:
df = pd.merge(nufus, maaliyetler, on='ilce', how='left')
df.isnull().sum().sum()

0

In [15]:
df.to_csv('../Datasets/PROCESSED/nufus_maaliyet.csv', index=False)

In [16]:
df2 = pd.merge(brewstation, df, on=['ilce', 'mahalle'], how='left')

In [17]:
df2.isnull().sum()

sehir               0
acik_adres          0
ilce                0
mahalle             0
nufus_yogunlugu    13
nufus              13
yuzolcumu          13
maliyet            13
dtype: int64

In [18]:
df2[df2['nufus_yogunlugu'].isnull()]['ilce'].unique()

array(['ATASEHIR', 'EYUP', 'BEYOGLU', 'EYUP ', 'TUZLA'], dtype=object)

In [19]:
df2[df2['nufus_yogunlugu'].isnull()]['mahalle'].unique()

array(['BARBAROS ', 'TOPCULAR', 'KEMENKES KARAMUSTAFAPASA',
       'KEMENKES KARA MUSTAFA PASA', 'GOKTURK MERKEZ', 'DEFTERDAR',
       'EMNIYETTEPE', 'FATIH ', 'YESILPINAR'], dtype=object)

In [20]:
df2[df2['nufus_yogunlugu'].isnull()][['ilce', 'mahalle']].drop_duplicates()

         ilce                     mahalle
12   ATASEHIR                   BARBAROS
35       EYUP                    TOPCULAR
81    BEYOGLU    KEMENKES KARAMUSTAFAPASA
83    BEYOGLU  KEMENKES KARA MUSTAFA PASA
100      EYUP              GOKTURK MERKEZ
102      EYUP                   DEFTERDAR
109     EYUP                  EMNIYETTEPE
219     TUZLA                      FATIH
268      EYUP                  YESILPINAR

In [21]:
brewstation['ilce'] = brewstation['ilce'].replace('EYUP', 'EYUPSULTAN')
brewstation['ilce'] = brewstation['ilce'].replace('EYUP ', 'EYUPSULTAN')
brewstation['mahalle'] = brewstation['mahalle'].replace('BARBAROS ', 'BARBAROS')

In [22]:
df[(df['ilce'].isin(['ATASEHIR', 'EYUP', 'BEYOGLU', 'EYUPSULTAN', 'TUZLA'])&
    (df['mahalle'].isin(['BARBAROS', 'TOPCULAR', 'KEMENKES KARAMUSTAFAPASA',
       'KEMENKES KARA MUSTAFA PASA', 'GOKTURK MERKEZ', 'DEFTERDAR',
       'EMNIYETTEPE', 'FATIH ', 'YESILPINAR'])))]

           ilce         mahalle nufus_yogunlugu  nufus yuzolcumu maliyet
53     ATASEHIR        BARBAROS         11065.0  32487       2.9  486000
404  EYUPSULTAN      YESILPINAR         30091.0  38497       1.3  471000
412  EYUPSULTAN     EMNIYETTEPE         12719.0   9397      0.74  471000
415  EYUPSULTAN       DEFTERDAR          5012.0   4709      0.94  471000
417  EYUPSULTAN        TOPCULAR          2820.0   4673       1.7  471000
418  EYUPSULTAN  GOKTURK MERKEZ          1261.0  36843      29.2  471000

In [23]:
df2 = pd.merge(brewstation, df, on=['ilce', 'mahalle'], how='left')

In [24]:
df2.isnull().sum()

sehir              0
acik_adres         0
ilce               0
mahalle            0
nufus_yogunlugu    4
nufus              4
yuzolcumu          4
maliyet            4
dtype: int64

In [25]:
df2[df2['nufus_yogunlugu'].isnull()][['ilce', 'mahalle']].drop_duplicates()

        ilce                     mahalle
81   BEYOGLU    KEMENKES KARAMUSTAFAPASA
83   BEYOGLU  KEMENKES KARA MUSTAFA PASA
219    TUZLA                      FATIH

In [26]:
df2[df2['nufus_yogunlugu'].isnull()]['ilce'].unique()

array(['BEYOGLU', 'TUZLA'], dtype=object)

In [27]:
df2[df2['nufus_yogunlugu'].isnull()]['mahalle'].unique()

array(['KEMENKES KARAMUSTAFAPASA', 'KEMENKES KARA MUSTAFA PASA', 'FATIH '],
      dtype=object)

In [28]:
brewstation['mahalle'] = brewstation['mahalle'].replace('FATIH ', 'FATIH')
brewstation['mahalle'] = brewstation['mahalle'].replace('KEMENKES KARAMUSTAFAPASA', 'KEMANKES KARA MUSTAFA PASA')
brewstation['mahalle'] = brewstation['mahalle'].replace('KEMENKES KARA MUSTAFA PASA', 'KEMANKES KARA MUSTAFA PASA')

In [29]:
df[df['ilce'].isin(['TUZLA', 'BEYOGLU'])&
   df['mahalle'].isin(["KEMENKES KARA MUSTAFA PASA", 'FATIH'])]

      ilce mahalle nufus_yogunlugu nufus yuzolcumu maliyet
869  TUZLA   FATIH           377.0  1045       2.8  294000

In [30]:
#find mahalles start with 'K'
df[df['mahalle'].str.startswith('K')]['mahalle'].unique()

array(['KARLIBAYIR', 'KARABURUN', 'KAYISDAGI', 'KUCUKBAKKALKOY',
       'KEMALPASA', 'KÂZIM KARABEKIR', 'KIRAZLI', 'KOCASINAN',
       'KARTALTEPE', 'KAYABASI', 'KOCATEPE', 'KULTUR', 'KONAKLAR',
       'KURUCESME', 'KAVACIK', 'KANLICA', 'KAYNARCA', 'KILICLI',
       'KAVAKLI', 'KADI MEHMET EFENDI', 'KALYONCUKULLUGU', 'KAPTANPASA',
       'KUCUKPIYALE', 'KULAKSIZ', 'KECECIPIRI', 'KULOGLU', 'KAMERHATUN',
       'KILICALIPASA', 'KATIP MUSTAFA CELEBI',
       'KEMANKES KARA MUSTAFA PASA', 'KUMBURGAZ MERKEZ', 'KAMILOBA',
       'KARAAGAC', 'KALEICI', 'KESTANELIK', 'KABAKCA', 'KARACAKOY',
       'KALFA', 'KARAMANDERE', 'KIZILCAALI', 'KIRAZLIDERE', 'KOCULLU',
       'KEMER', 'KOZA', 'KARADOLAP', 'KOCAMUSTAFAPASA', 'KARAGUMRUK',
       'KATIP KASIM', 'KALENDERHANE', 'KUCUKAYASOFYA', 'KARLITEPE',
       'KARADENIZ', 'KARAYOLLARI', 'KOZYATAGI', 'KOSUYOLU', 'KARLIKTEPE',
       'KORDONBOYU', 'KANARYA', 'KUCUKYALI', 'KAVAKPINAR', 'KURTKOY',
       'KURNA', 'KURTDOGMUS', 'KEMAL TURKLER', 'KIRECBURNU', 'KOCATAS',
       'KUMKOY', 'KISIRKAYA', 'KUMBABA', 'KURFALLI', 'KADIKOY', 'KABAKOZ',
       'KORUCU', 'KIZILCA', 'KOMURLUK', 'KARABEYLI', 'KARAKIRAZ', 'KALEM',
       'KERVANSARAY', 'KUCUK KILICLI', 'KUCUK SINEKLI', 'KUSTEPE',
       'KUPLUCE', 'KIRAZLITEPE', 'KISIKLI', 'KUCUKSU', 'KUCUK CAMLICA',
       'KULELI', 'KUZGUNCUK', 'KANDILLI', 'KAZLICESME'], dtype=object)

In [31]:
df2 = pd.merge(brewstation, df, on=['ilce', 'mahalle'], how='left')
df2.isnull().sum()

sehir              0
acik_adres         0
ilce               0
mahalle            0
nufus_yogunlugu    0
nufus              0
yuzolcumu          0
maliyet            0
dtype: int64

In [32]:
df2.to_csv('../Datasets/PROCESSED/brewstation.csv', index=False)